src/DataProcessors/ПрограммнаяРаботаСОбъектами_ДомашнееЗадание/ПрограммнаяРаботаСОбъектами_ДомашнееЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПрограммнаяРаботаСОбъектами_ДомашнееЗадание</name>
</mdclass:DataProcessor>

src/InformationRegisters/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводственныйКалендарь</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейКалендаря</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыДнейКалендаря/ВидыДнейКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераТелефонов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПривлечения</name>
    <type>
      <types>CatalogRef.ИсточникиПривлечения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>ДопРеквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПрограммнаяРаботаСОбъектами_ДомашнееЗадание/Forms/Форма/Module.bsl
#Область Задача1

&НаКлиенте
Процедура ПолучитьЗначениеКонстанты(Команда)
	ПолучитьЗначениеКонстантыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗначениеКонстантыНаСервере()

	//1. Получить значение константы "МаксимальныйРазмерФайла"
	
КонецПроцедуры

#КонецОбласти
         
#Область Задача2
		 
&НаКлиенте
Процедура ИзменитьКонстанту(Команда)
	ИзменитьКонстантуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьКонстантуНаСервере()

	//2. Установить для константы "ДатаЗапретаРедактирования" значение - последний день предыдущего месяца
	Константы.ДатаЗапретаРедактирования.Установить(ТекущаяДата());

КонецПроцедуры

#КонецОбласти

#Область Задача3

&НаКлиенте
Процедура НайтиНоменклатуруПоКоду(Команда)
	НайтиНоменклатуруПоКодуНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиНоменклатуруПоКодуНаСервере()

	//3. В справочнике "Номенклатура" найти номенклатуру по коду "000000022" и сообщить её наименование.
	//Если номенклатура отсутствует в справочнике, сообщить об этом пользователю
	
КонецПроцедуры

#КонецОбласти

#Область Задача4

&НаКлиенте
Процедура НайтиНоменклатуруПоНаименованию(Команда)
	НайтиНоменклатуруПоНаименованиюНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиНоменклатуруПоНаименованиюНаСервере()

	//4. В справочнике "Номенклатура" найти номенклатуру по наименованию "Смартфон Apple iPhone 13 128GB (темная ночь)"
	//и сообщить артикул найденной номенклатуры.
	//Если номенклатура отсутствует в справочнике, сообщить об этом пользователю

КонецПроцедуры

#КонецОбласти

#Область Задача5

&НаКлиенте
Процедура НайтиКонтрагентаПоИНН(Команда)
	НайтиКонтрагентаПоИНННаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиКонтрагентаПоИНННаСервере()
	
	//5. В справочнике "Контрагенты" найти контрагента по УНП "196874587"
	//Если контрагент отсутствует в справочнике, сообщить об этом пользователю

КонецПроцедуры

#КонецОбласти   

#Область Задача6   

&НаКлиенте
Процедура ПоискИСозданиеНоменклатуры(Команда)
	ПоискИСозданиеНоменклатурыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоискИСозданиеНоменклатурыНаСервере()
	
	//6. В справочнике "Номенклатура" в группе "Телевизоры" нужно выполнить поиск  
	//номенклатуры по наименованию "Телевизор Thomson T43USM7020" (артикул "T43USM7020").
	//Если номенклатура найдена, то нужно сообщить значение реквизита "Наименование".
	//Если номенклатуры нет в справочнике, нужно её создать программно и заполнить реквизиты:
	//Наименование: "Телевизор Thomson T43USM7020"
	//Артикул: "T43USM7020"
	//ВидНоменклатуры: "Телевизоры" (ссылка на справочник "Виды номенклатуры")
	//Родитель (группа): "Телевизоры" (ссылка на группу справочника "Номенклатура"
	//Единица измерения: "шт" (ссылка на справочник "Классификатор единиц измерения")
	
	
КонецПроцедуры

#КонецОбласти  

#Область Задача7  

&НаКлиенте
Процедура НайтиДоговорКонтрагента(Команда)
	НайтиДоговорКонтрагентаНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиДоговорКонтрагентаНаСервере()
	
	//7. Найти договор контрагента "Электротовары база ООО" с номером "14". 
	//Если договор отсутствует в справочнике, сообщить об этом пользователю
	
КонецПроцедуры

#КонецОбласти 

#Область Задача8    

&НаКлиенте
Процедура КоличествоДоговоровСКонтрагентом(Команда)
	КоличествоДоговоровСКонтрагентомНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоличествоДоговоровСКонтрагентомНаСервере()
	
	//8. Нужно определить количество договоров контрагента "Электротовары база ООО" (ИНН 196874587)
	//и сообщить пользователю в формате "Найдено договоров: [Количество]"
	
КонецПроцедуры

#КонецОбласти

#Область Задача9

&НаКлиенте
Процедура ПометитьНаУдалениеКонтрагента(Команда)
	ПометитьНаУдалениеКонтрагентаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеКонтрагентаНаСервере()
	
	//9. Пометить на удаление контрагента "Васильков В.А." (ИНН 12345678)
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "12345678");
	Если Контрагент.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Контрагент не найден";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	//по ссылке получаем объект
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	КонтрагентОбъект.УстановитьПометкуУдаления(Истина);
	
	//КонтрагентОбъект.ПометкаУдаления = Истина;
	//КонтрагентОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Задача10

&НаКлиенте
Процедура ПолучитьЮридическийАдресКонтрагента(Команда)
	ПолучитьЮридическийАдресКонтрагентаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьЮридическийАдресКонтрагентаНаСервере()
	
	//10. Получить юридический адрес контрагента "Прокси Торг ООО" (ИНН 196245564) и сообщить его пользователю
	
	//1. поиск ссылки на контрагента
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "196245564");
	
	//2. проверить найден/не найден
	Если Контрагент.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Контрагент не найден";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	//3. Получить данные объекта по ссылке
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	Контакты = КонтрагентОбъект.КонтактнаяИнформация;
	
	ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	НайденнаяСтрока = Контакты.Найти(ВидКИ, "Вид");
	Если НайденнаяСтрока = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Юридический адрес не заполнен";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	ЮрАдрес = НайденнаяСтрока.Значение;
	Сообщить(ЮрАдрес);
	
КонецПроцедуры
	
#КонецОбласти 

#Область Задача11

&НаКлиенте
Процедура ЗаполнитьЮридическийАдресКонтрагента(Команда)
	ЗаполнитьЮридическийАдресКонтрагентаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЮридическийАдресКонтрагентаНаСервере()
	
	//11. Заполнить юридический адрес контрагента "Терминатор ООО" (ИНН 124124214) значением:
	//"119021, город Москва, ул. Льва Толстого, д. 16"
	
КонецПроцедуры
	
#КонецОбласти 

#Область Задача12

&НаСервере
Процедура ИзменитьАртикулНоменклатурыНаСервере()
	
	//12. Изменить артикул номенклатуры "Смартфон POCO X3" (код "000000003"):
	//установить значение артикула "X-3P"
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАртикулНоменклатуры(Команда)
	ИзменитьАртикулНоменклатурыНаСервере();
КонецПроцедуры
	
#КонецОбласти

#Область Задача13

&НаКлиенте
Процедура СоздатьГруппуНоменклатуры(Команда)
	СоздатьГруппуНоменклатурыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппуНоменклатурыНаСервере()
	
	//13. Создать группу номенклатуры с наименованием "Роботы-пылесосы"
	
КонецПроцедуры

#КонецОбласти

#Область Задача14

&НаКлиенте
Процедура ПереместитьНоменклатуруВГруппу(Команда)
	ПереместитьНоменклатуруВГруппуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПереместитьНоменклатуруВГруппуНаСервере()
	
	//14. Переместить номенклатуру с наименованием "Робот-пылесос Redmond RV-R650S WiFi" в группу "Роботы-пылесосы"
	
КонецПроцедуры

#КонецОбласти

#Область Задача15

&НаКлиенте
Процедура ЗаполнитьПроизводственныйКалендарь(Команда)
	ЗаполнитьПроизводственныйКалендарьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроизводственныйКалендарьНаСервере()
	
	//15. Заполнить регистр сведений "Производственный календарь" данными за текущий год:
	//добавить для каждой даты текушего года запись в регистр сведений и заполнить "ВидДня" по следующему принципу:
	//1 января и 8 марта: Вид дня "Праздник"
	//31 декабря и 7 марта: Вид дня "Предпраздничный"
	//Для всех остальных дат: 
	//   - если день недели "Суббота", то вид дня "Суббота"
	//   - если день недели "Воскресенье", то вид дня "Воскресенье"
	//   - если день недели с понедельника по пятницу, то вид дня "Рабочий"
	
	ТекДата = НачалоГода(ТекущаяДата());
	КонДата = КонецГода(ТекущаяДата());
	
	Пока ТекДата <= КонДата Цикл
		
		НоваяЗапись = РегистрыСведений.ПроизводственныйКалендарь.СоздатьМенеджерЗаписи();
		НоваяЗапись.Дата = ТекДата;
		
		Если (День(ТекДата) = 1 И Месяц(ТекДата) = 1) ИЛИ (День(ТекДата) = 8 И Месяц(ТекДата) = 3) Тогда
			ВидДня = Перечисления.ВидыДнейКалендаря.Праздник;
		ИначеЕсли (День(ТекДата) = 31 И Месяц(ТекДата) = 12) ИЛИ (День(ТекДата) = 7 И Месяц(ТекДата) = 3) Тогда
			ВидДня = Перечисления.ВидыДнейКалендаря.Предпраздничный;
		ИначеЕсли ДеньНедели(ТекДата) = 6 Тогда
			ВидДня = Перечисления.ВидыДнейКалендаря.Суббота;
		ИначеЕсли ДеньНедели(ТекДата) = 7 Тогда
			ВидДня = Перечисления.ВидыДнейКалендаря.Воскресенье;
		Иначе
			ВидДня = Перечисления.ВидыДнейКалендаря.Рабочий;
		КонецЕсли; 
		
		НоваяЗапись.ВидДня = ВидДня;
		НоваяЗапись.Записать();
		
		ТекДата = ТекДата + 86400;
		
	КонецЦикла; 
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Заполнение календаря завершено...";
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#Область Задача16

&НаКлиенте
Процедура АктуальныйКурсДоллара(Команда)
	АктуальныйКурсДоллараНаСервере();
КонецПроцедуры

&НаСервере
Процедура АктуальныйКурсДоллараНаСервере()
	
	//16. Получить актуальный на текущую дату курс доллара (Валюта "USD") 
	//из регистра сведений "Курсы валют" и сообщить его пользователю
		
КонецПроцедуры
	
#КонецОбласти
